```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.bootstrap.module.aws_organization.random_string.random: Refreshing state... [id=apf4]
module.bootstrap.module.aws_organization.aws_organizations_account.account: Refreshing state... [id=433876926505]
module.bootstrap.module.aws_organization.time_sleep.wait_120_seconds: Refreshing state... [id=2020-10-13T03:48:08Z]
module.bootstrap.module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.bootstrap.module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-10-14 05:39:28.35041433 +0000 UTC]
module.bootstrap.module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-10-14 05:39:28.173146955 +0000 UTC]
module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:433876926505:certificate/bb64bd45-6660-4b6d-8f8c-dc35cdcac18c]
module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:433876926505:certificate/3d7952d7-581a-454c-b834-0c6e45538e3c]
module.bootstrap.module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-apf4-logs-cloudtrail]
module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:433876926505:certificate/6d862f88-f351-439e-ab49-58f5fe2f9a2e]
module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:433876926505:certificate/6a3fc98a-7ddd-46cf-b41f-da1daa174770]
module.bootstrap.module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=599260274]
module.bootstrap.module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=52dd563e-173b-491e-9041-360f7834ef2f]
module.bootstrap.module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-apf4-logs-cloudtrail]
module.bootstrap.module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-apf4-logs-cloudtrail]
module.bootstrap.module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.bootstrap.module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state...
module.bootstrap.module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state...
module.bootstrap.module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N09588463V3O44SECIXW7]
module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-east-1:433876926505:certificate/dc5cc1cb-1492-43fd-9250-a1641f439384]
module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-east-1:433876926505:certificate/bd99428c-96c4-4811-b781-abebb477afd8]
module.bootstrap.module.dns.module.dns["nonlive"].time_sleep.check_email_for_cert_validations: Refreshing state... [id=2020-10-14T04:47:39Z]
module.bootstrap.module.dns.module.dns["live"].time_sleep.check_email_for_cert_validations: Refreshing state... [id=2020-10-14T04:47:39Z]
module.bootstrap.module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z08664503AM2AGYQDBUC0]
module.bootstrap.module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z0992219MXVJ9EOBO22O]
module.bootstrap.module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.bootstrap.module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.bootstrap.module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api: Refreshing state... [id=7whmb5ex3a]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-live-access-logs]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group: Refreshing state... [id=/aws/apigateway/example-nonlive-access-logs]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-nonlive]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api: Refreshing state... [id=gjcv6ghq4g]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group: Refreshing state... [id=/aws/apigateway/example-live]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.data.aws_iam_policy_document.base: Refreshing state... [id=704701628]
module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.cloudformation: Refreshing state... [id=3853530454]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_role.cloudformation: Refreshing state... [id=serverless-example-api-cloudformation]
module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.data.aws_iam_policy_document.base: Refreshing state... [id=3454387480]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role.role: Refreshing state... [id=serverless-example-api-nonlive]
module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role.role: Refreshing state... [id=serverless-example-api-live]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user.user: Refreshing state... [id=serverless-example-api-deployer]
module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.deployer: Refreshing state... [id=1350816066]
module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.assume_cloudformation_role: Refreshing state... [id=643366571]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_role_policy.cloudformation_policy: Refreshing state... [id=serverless-example-api-cloudformation:base-policy]
module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role_policy.base: Refreshing state... [id=serverless-example-api-live:base]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role_policy.base: Refreshing state... [id=serverless-example-api-nonlive:base]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_access_key.access_key: Refreshing state... [id=AKIAWKBIUQAUWZ7H5PAL]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.assume_cloudformation_role: Refreshing state... [id=serverless-example-api-deployer:assume-cloudformation-role]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.policy: Refreshing state... [id=serverless-example-api-deployer:base-policy]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health: Refreshing state... [id=4crz2d]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-gjcv6ghq4g-DEFAULT_4XX]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_7whmb5ex3a/live]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group: Refreshing state... [id=API-Gateway-Execution-Logs_gjcv6ghq4g/nonlive]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health: Refreshing state... [id=8v2q9v]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors: Refreshing state... [id=aggr-7whmb5ex3a-DEFAULT_4XX]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-gjcv6ghq4g-4crz2d-GET]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get: Refreshing state... [id=agm-7whmb5ex3a-8v2q9v-GET]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-7whmb5ex3a-8v2q9v-GET-200]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200: Refreshing state... [id=agmr-gjcv6ghq4g-4crz2d-GET-200]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-gjcv6ghq4g-4crz2d-GET]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get: Refreshing state... [id=agi-7whmb5ex3a-8v2q9v-GET]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-7whmb5ex3a-8v2q9v-GET-200]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200: Refreshing state... [id=agir-gjcv6ghq4g-4crz2d-GET-200]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment: Refreshing state... [id=smknkf]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment: Refreshing state... [id=pu9p54]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-gjcv6ghq4g-nonlive]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage: Refreshing state... [id=ags-7whmb5ex3a-live]
module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings: Refreshing state... [id=gjcv6ghq4g-nonlive-*/*]
module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings: Refreshing state... [id=7whmb5ex3a-live-*/*]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.bootstrap.module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = "arn:aws:acm:us-east-1:433876926505:certificate/dc5cc1cb-1492-43fd-9250-a1641f439384"
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "api.scaffoldly.com"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.scaffoldly.com"
      + type            = "A"
      + zone_id         = "Z08664503AM2AGYQDBUC0"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = "arn:aws:acm:us-east-1:433876926505:certificate/bd99428c-96c4-4811-b781-abebb477afd8"
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "api.scaffoldly.dev"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.scaffoldly.dev"
      + type            = "A"
      + zone_id         = "Z0992219MXVJ9EOBO22O"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.apex will be destroyed
  - resource "aws_acm_certificate" "apex" {
      - arn                       = "arn:aws:acm:us-east-1:433876926505:certificate/bb64bd45-6660-4b6d-8f8c-dc35cdcac18c" -> null
      - domain_name               = "scaffold.ly" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "scaffold.ly"
              - resource_record_name  = "_99d38cd20751ef8eed60aa6890bc4164.scaffold.ly."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_c357ac111c3d62e476a8537823110c5d.bsgbmzkfwj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:433876926505:certificate/bb64bd45-6660-4b6d-8f8c-dc35cdcac18c" -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard will be destroyed
  - resource "aws_acm_certificate" "subdomain_wildcard" {
      - arn                       = "arn:aws:acm:us-east-1:433876926505:certificate/6d862f88-f351-439e-ab49-58f5fe2f9a2e" -> null
      - domain_name               = "*.scaffold.ly" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.scaffold.ly"
              - resource_record_name  = "_99d38cd20751ef8eed60aa6890bc4164.scaffold.ly."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_c357ac111c3d62e476a8537823110c5d.bsgbmzkfwj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:433876926505:certificate/6d862f88-f351-439e-ab49-58f5fe2f9a2e" -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.apex will be destroyed
  - resource "aws_acm_certificate" "apex" {
      - arn                       = "arn:aws:acm:us-east-1:433876926505:certificate/6a3fc98a-7ddd-46cf-b41f-da1daa174770" -> null
      - domain_name               = "scaffoldly.dev" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "scaffoldly.dev"
              - resource_record_name  = "_306d94f88dfed4d73188ff275ad5bd92.scaffoldly.dev."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_b0ef930d34f1412c850696392c37cac4.bsgbmzkfwj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:433876926505:certificate/6a3fc98a-7ddd-46cf-b41f-da1daa174770" -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard will be destroyed
  - resource "aws_acm_certificate" "subdomain_wildcard" {
      - arn                       = "arn:aws:acm:us-east-1:433876926505:certificate/3d7952d7-581a-454c-b834-0c6e45538e3c" -> null
      - domain_name               = "*.scaffoldly.dev" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.scaffoldly.dev"
              - resource_record_name  = "_306d94f88dfed4d73188ff275ad5bd92.scaffoldly.dev."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_b0ef930d34f1412c850696392c37cac4.bsgbmzkfwj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:433876926505:certificate/3d7952d7-581a-454c-b834-0c6e45538e3c" -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.assume_cloudformation_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_cloudformation_role"  {
      ~ id      = "643366571" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::433876926505:role/serverless-example-api-cloudformation"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
            actions       = [
                "iam:PassRole",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:aws:iam::433876926505:role/serverless-example-api-cloudformation",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.cloudformation will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudformation"  {
      ~ id      = "3853530454" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:*:iam::*:role/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "cloudformation:UpdateStack",
                          - "cloudformation:PreviewStackUpdate",
                          - "cloudformation:List*",
                          - "cloudformation:Get*",
                          - "cloudformation:Describe*",
                          - "cloudformation:CreateStack",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudformation:ValidateTemplate"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:s3:::serverless-example-api*/*",
                          - "arn:*:s3:::serverless-example-api*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:CreateBucket",
                          - "s3:*Notification*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "apigateway:PUT",
                          - "apigateway:POST",
                          - "apigateway:PATCH",
                          - "apigateway:OPTIONS",
                          - "apigateway:HEAD",
                          - "apigateway:GET",
                          - "apigateway:DELETE",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:apigateway:*::/usageplans/*",
                          - "arn:*:apigateway:*::/usageplans*",
                          - "arn:*:apigateway:*::/restapis/*",
                          - "arn:*:apigateway:*::/restapis*",
                          - "arn:*:apigateway:*::/apis/*",
                          - "arn:*:apigateway:*::/apis*",
                          - "arn:*:apigateway:*::/apikeys/*",
                          - "arn:*:apigateway:*::/apikeys*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "arn:*:logs:*:*:log-group::log-stream:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:FilterLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DeleteLogStream",
                          - "logs:DeleteLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:logs:*:*:log-group:/aws/lambda/serverless-example-api*:log-stream:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:RemoveTargets",
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                          - "events:DeleteRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:events:*:*:rule/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "lambda:Update*",
                          - "lambda:Untag*",
                          - "lambda:Tag*",
                          - "lambda:Remove*",
                          - "lambda:Publish*",
                          - "lambda:List*",
                          - "lambda:Invoke*",
                          - "lambda:Get*",
                          - "lambda:Delete*",
                          - "lambda:Create*",
                          - "lambda:Add*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:*"
                      - Effect   = "Allow"
                      - Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:*EventSourceMapping*"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateTable*",
                          - "dynamodb:UpdateContinuousBackups",
                          - "dynamodb:RestoreTable*",
                          - "dynamodb:List*",
                          - "dynamodb:GetShardIterator",
                          - "dynamodb:Describe*",
                          - "dynamodb:DeleteTable*",
                          - "dynamodb:CreateTable*",
                          - "dynamodb:*Tag*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
                          - "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:*SamplingRule*",
                          - "xray:*Group*",
                          - "xray:*EncryptionConfig*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
            actions       = [
                "iam:PassRole",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:iam::*:role/serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "cloudformation:CreateStack",
                "cloudformation:Describe*",
                "cloudformation:Get*",
                "cloudformation:List*",
                "cloudformation:PreviewStackUpdate",
                "cloudformation:UpdateStack",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:cloudformation:*:*:stack/serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "cloudformation:ValidateTemplate",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
      ~ statement {
            actions       = [
                "s3:*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:s3:::serverless-example-api*",
                "arn:*:s3:::serverless-example-api*/*",
            ]
        }
      ~ statement {
            actions       = [
                "s3:*Notification*",
                "s3:CreateBucket",
                "s3:ListAllMyBuckets",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
      ~ statement {
            actions       = [
                "apigateway:DELETE",
                "apigateway:GET",
                "apigateway:HEAD",
                "apigateway:OPTIONS",
                "apigateway:PATCH",
                "apigateway:POST",
                "apigateway:PUT",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:apigateway:*::/apikeys*",
                "arn:*:apigateway:*::/apikeys/*",
                "arn:*:apigateway:*::/apis*",
                "arn:*:apigateway:*::/apis/*",
                "arn:*:apigateway:*::/restapis*",
                "arn:*:apigateway:*::/restapis/*",
                "arn:*:apigateway:*::/usageplans*",
                "arn:*:apigateway:*::/usageplans/*",
            ]
        }
      ~ statement {
            actions       = [
                "logs:DescribeLogGroups",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:logs:*:*:log-group::log-stream:*",
            ]
        }
      ~ statement {
            actions       = [
                "logs:CreateLogGroup",
                "logs:CreateLogStream",
                "logs:DeleteLogGroup",
                "logs:DeleteLogStream",
                "logs:DescribeLogStreams",
                "logs:FilterLogEvents",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:logs:*:*:log-group:/aws/lambda/serverless-example-api*:log-stream:*",
            ]
        }
      ~ statement {
            actions       = [
                "events:DeleteRule",
                "events:DescribeRule",
                "events:PutRule",
                "events:PutTargets",
                "events:RemoveTargets",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:events:*:*:rule/serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "lambda:Add*",
                "lambda:Create*",
                "lambda:Delete*",
                "lambda:Get*",
                "lambda:Invoke*",
                "lambda:List*",
                "lambda:Publish*",
                "lambda:Remove*",
                "lambda:Tag*",
                "lambda:Untag*",
                "lambda:Update*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "lambda:*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "lambda:*EventSourceMapping*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
      ~ statement {
            actions       = [
                "dynamodb:*Tag*",
                "dynamodb:CreateTable*",
                "dynamodb:DeleteTable*",
                "dynamodb:Describe*",
                "dynamodb:GetShardIterator",
                "dynamodb:List*",
                "dynamodb:RestoreTable*",
                "dynamodb:UpdateContinuousBackups",
                "dynamodb:UpdateTable*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
                "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "xray:*EncryptionConfig*",
                "xray:*Group*",
                "xray:*SamplingRule*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.deployer will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deployer"  {
      ~ id      = "1350816066" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:s3:::serverless-example-api*/*",
                          - "arn:*:s3:::serverless-example-api*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:CreateBucket",
                          - "s3:*Notification*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "cloudformation:UpdateStack",
                          - "cloudformation:DeleteStack",
                          - "cloudformation:CreateStack",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "cloudformation:ValidateTemplate",
                          - "cloudformation:PreviewStackUpdate",
                          - "cloudformation:List*",
                          - "cloudformation:Get*",
                          - "cloudformation:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "apigateway:GET"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:apigateway:*::/apikeys/*",
                          - "arn:*:apigateway:*::/apikeys*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "apigateway:POST",
                          - "apigateway:PATCH",
                          - "apigateway:GET",
                          - "apigateway:DELETE",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:apigateway:*::/domainnames/*",
                          - "arn:*:apigateway:*::/domainnames*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:*"
                      - Effect   = "Allow"
                      - Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:*SamplingRule*",
                          - "xray:*Group*",
                          - "xray:*EncryptionConfig*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
            actions       = [
                "s3:*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:s3:::serverless-example-api*",
                "arn:*:s3:::serverless-example-api*/*",
            ]
        }
      ~ statement {
            actions       = [
                "s3:*Notification*",
                "s3:CreateBucket",
                "s3:ListAllMyBuckets",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
      ~ statement {
            actions       = [
                "cloudformation:CreateStack",
                "cloudformation:DeleteStack",
                "cloudformation:UpdateStack",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:cloudformation:*:*:stack/serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "cloudformation:Describe*",
                "cloudformation:Get*",
                "cloudformation:List*",
                "cloudformation:PreviewStackUpdate",
                "cloudformation:ValidateTemplate",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
      ~ statement {
            actions       = [
                "apigateway:GET",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:apigateway:*::/apikeys*",
                "arn:*:apigateway:*::/apikeys/*",
            ]
        }
      ~ statement {
            actions       = [
                "apigateway:DELETE",
                "apigateway:GET",
                "apigateway:PATCH",
                "apigateway:POST",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:apigateway:*::/domainnames*",
                "arn:*:apigateway:*::/domainnames/*",
            ]
        }
      ~ statement {
            actions       = [
                "lambda:*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "xray:*EncryptionConfig*",
                "xray:*Group*",
                "xray:*SamplingRule*",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_role_policy.cloudformation_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "cloudformation_policy" {
        id     = "serverless-example-api-cloudformation:base-policy"
        name   = "base-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:*:iam::*:role/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "cloudformation:UpdateStack",
                          - "cloudformation:PreviewStackUpdate",
                          - "cloudformation:List*",
                          - "cloudformation:Get*",
                          - "cloudformation:Describe*",
                          - "cloudformation:CreateStack",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudformation:ValidateTemplate"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:s3:::serverless-example-api*/*",
                          - "arn:*:s3:::serverless-example-api*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:CreateBucket",
                          - "s3:*Notification*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "apigateway:PUT",
                          - "apigateway:POST",
                          - "apigateway:PATCH",
                          - "apigateway:OPTIONS",
                          - "apigateway:HEAD",
                          - "apigateway:GET",
                          - "apigateway:DELETE",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:apigateway:*::/usageplans/*",
                          - "arn:*:apigateway:*::/usageplans*",
                          - "arn:*:apigateway:*::/restapis/*",
                          - "arn:*:apigateway:*::/restapis*",
                          - "arn:*:apigateway:*::/apis/*",
                          - "arn:*:apigateway:*::/apis*",
                          - "arn:*:apigateway:*::/apikeys/*",
                          - "arn:*:apigateway:*::/apikeys*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "arn:*:logs:*:*:log-group::log-stream:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:FilterLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DeleteLogStream",
                          - "logs:DeleteLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:logs:*:*:log-group:/aws/lambda/serverless-example-api*:log-stream:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:RemoveTargets",
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                          - "events:DeleteRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:events:*:*:rule/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "lambda:Update*",
                          - "lambda:Untag*",
                          - "lambda:Tag*",
                          - "lambda:Remove*",
                          - "lambda:Publish*",
                          - "lambda:List*",
                          - "lambda:Invoke*",
                          - "lambda:Get*",
                          - "lambda:Delete*",
                          - "lambda:Create*",
                          - "lambda:Add*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:*"
                      - Effect   = "Allow"
                      - Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:*EventSourceMapping*"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateTable*",
                          - "dynamodb:UpdateContinuousBackups",
                          - "dynamodb:RestoreTable*",
                          - "dynamodb:List*",
                          - "dynamodb:GetShardIterator",
                          - "dynamodb:Describe*",
                          - "dynamodb:DeleteTable*",
                          - "dynamodb:CreateTable*",
                          - "dynamodb:*Tag*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
                          - "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:*SamplingRule*",
                          - "xray:*Group*",
                          - "xray:*EncryptionConfig*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        role   = "serverless-example-api-cloudformation"
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.assume_cloudformation_role will be updated in-place
  ~ resource "aws_iam_user_policy" "assume_cloudformation_role" {
        id     = "serverless-example-api-deployer:assume-cloudformation-role"
        name   = "assume-cloudformation-role"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::433876926505:role/serverless-example-api-cloudformation"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        user   = "serverless-example-api-deployer"
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.policy will be updated in-place
  ~ resource "aws_iam_user_policy" "policy" {
        id     = "serverless-example-api-deployer:base-policy"
        name   = "base-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:s3:::serverless-example-api*/*",
                          - "arn:*:s3:::serverless-example-api*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:CreateBucket",
                          - "s3:*Notification*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "cloudformation:UpdateStack",
                          - "cloudformation:DeleteStack",
                          - "cloudformation:CreateStack",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:cloudformation:*:*:stack/serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "cloudformation:ValidateTemplate",
                          - "cloudformation:PreviewStackUpdate",
                          - "cloudformation:List*",
                          - "cloudformation:Get*",
                          - "cloudformation:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "apigateway:GET"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:apigateway:*::/apikeys/*",
                          - "arn:*:apigateway:*::/apikeys*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "apigateway:POST",
                          - "apigateway:PATCH",
                          - "apigateway:GET",
                          - "apigateway:DELETE",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:*:apigateway:*::/domainnames/*",
                          - "arn:*:apigateway:*::/domainnames*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:*"
                      - Effect   = "Allow"
                      - Resource = "arn:*:lambda:*:*:function:serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:*SamplingRule*",
                          - "xray:*Group*",
                          - "xray:*EncryptionConfig*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        user   = "serverless-example-api-deployer"
    }

  # module.bootstrap.module.serverless_api["example"].module.repository.github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = "master"
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "serverless-example-api"
      + node_id                = (known after apply)
      + private                = true
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)

      + template {
          + owner      = "scaffoldly"
          + repository = "serverless-template-api"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix = (known after apply)
      + id         = (known after apply)
      + partition  = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "lambda/live/serverless-example-api"
      + name_prefix             = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].aws_secretsmanager_secret_version.value will be created
  + resource "aws_secretsmanager_secret_version" "value" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_access_key will be created
  + resource "github_actions_secret" "deployer_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_account_id will be created
  + resource "github_actions_secret" "deployer_aws_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_partition will be created
  + resource "github_actions_secret" "deployer_aws_partition" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_PARTITION"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_REST_API_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_root_resource_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_root_resource_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_REST_API_ROOT_RESOURCE_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_secret_key will be created
  + resource "github_actions_secret" "deployer_aws_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix = (known after apply)
      + id         = (known after apply)
      + partition  = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "lambda/nonlive/serverless-example-api"
      + name_prefix             = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].aws_secretsmanager_secret_version.value will be created
  + resource "aws_secretsmanager_secret_version" "value" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_access_key will be created
  + resource "github_actions_secret" "deployer_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_account_id will be created
  + resource "github_actions_secret" "deployer_aws_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_partition will be created
  + resource "github_actions_secret" "deployer_aws_partition" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_PARTITION"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_REST_API_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_root_resource_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_root_resource_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_REST_API_ROOT_RESOURCE_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_secret_key will be created
  + resource "github_actions_secret" "deployer_aws_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = "7whmb5ex3a"
      + base_path   = "example"
      + domain_name = "api.scaffoldly.com"
      + id          = (known after apply)
      + stage_name  = "live"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date      = "2020-10-13T03:49:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-east-1:433876926505:7whmb5ex3a/bootstrap" -> (known after apply)
      ~ id                = "pu9p54" -> (known after apply)
      ~ invoke_url        = "https://7whmb5ex3a.execute-api.us-east-1.amazonaws.com/bootstrap" -> (known after apply)
        rest_api_id       = "7whmb5ex3a"
        stage_description = "A basic stage created to remediate a race condition in API Gateway"
        stage_name        = "bootstrap"
      ~ triggers          = { # forces replacement
          ~ "redeployment" = "2f1714c52600e6115162966a4851827b54bb9a1e" -> "9bfa556c97fa33f59ec60e21e964fc78f00e3ad3"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = "gjcv6ghq4g"
      + base_path   = "example"
      + domain_name = "api.scaffoldly.dev"
      + id          = (known after apply)
      + stage_name  = "nonlive"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date      = "2020-10-13T03:49:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-east-1:433876926505:gjcv6ghq4g/bootstrap" -> (known after apply)
      ~ id                = "smknkf" -> (known after apply)
      ~ invoke_url        = "https://gjcv6ghq4g.execute-api.us-east-1.amazonaws.com/bootstrap" -> (known after apply)
        rest_api_id       = "gjcv6ghq4g"
        stage_description = "A basic stage created to remediate a race condition in API Gateway"
        stage_name        = "bootstrap"
      ~ triggers          = { # forces replacement
          ~ "redeployment" = "e7dfa47729946ec5b3e634dde966ecf9e39682de" -> "b5939a90d6533b397d70f26f2c33cd043e38a29f"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      ~ id      = "3454387480" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:List*",
                          - "dynamodb:Describe*",
                          - "dynamodb:*Item*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:dynamodb:*:*:table/live-serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
            actions       = [
                "cloudwatch:PutMetricData",
                "logs:CreateLogGroup",
                "logs:CreateLogStream",
                "logs:PutLogEvents",
                "xray:PutTelemetryRecords",
                "xray:PutTraceSegments",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
      ~ statement {
            actions       = [
                "dynamodb:*Item*",
                "dynamodb:Describe*",
                "dynamodb:List*",
                "dynamodb:Query",
                "dynamodb:Scan",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "secretsmanager:GetSecretValue",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role_policy.base will be updated in-place
  ~ resource "aws_iam_role_policy" "base" {
        id     = "serverless-example-api-live:base"
        name   = "base"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:List*",
                          - "dynamodb:Describe*",
                          - "dynamodb:*Item*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:dynamodb:*:*:table/live-serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        role   = "serverless-example-api-live"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      ~ id      = "704701628" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:List*",
                          - "dynamodb:Describe*",
                          - "dynamodb:*Item*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
            actions       = [
                "cloudwatch:PutMetricData",
                "logs:CreateLogGroup",
                "logs:CreateLogStream",
                "logs:PutLogEvents",
                "xray:PutTelemetryRecords",
                "xray:PutTraceSegments",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "*",
            ]
        }
      ~ statement {
            actions       = [
                "dynamodb:*Item*",
                "dynamodb:Describe*",
                "dynamodb:List*",
                "dynamodb:Query",
                "dynamodb:Scan",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
            ]
        }
      ~ statement {
            actions       = [
                "secretsmanager:GetSecretValue",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            resources     = [
                "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role_policy.base will be updated in-place
  ~ resource "aws_iam_role_policy" "base" {
        id     = "serverless-example-api-nonlive:base"
        name   = "base"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:List*",
                          - "dynamodb:Describe*",
                          - "dynamodb:*Item*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        role   = "serverless-example-api-nonlive"
    }

Plan: 25 to add, 5 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```